meshcore-cz/corefw/firmware/platform/nrf52/nrf52_target_main.cpp
// nRF52 target entrypoint — shared by every nRF52840 corefw board.
//
// TARGET-ONLY reference wiring (COREFW_TARGET && NRF52_PLATFORM). This is the one
// concrete Arduino setup()/loop() for the nRF52 family (Wio Tracker L1, SenseCAP
// Solar, …): SX1262 radio + BLE/USB transport + optional OLED + optional buzzer.
// Board differences arrive as -D defines and through the Board object the
// generated composition root registered — this file constructs no board-specific
// peripheral by name. A build compiles exactly one platform main (this file for
// nRF52, esp32_target_main.cpp for ESP32), so there is never a duplicate
// setup()/loop() even with several nRF52 boards in the tree.
//
// The presence of a panel is compile-time: when the board manifest declares a
// display, DISPLAY_CLASS / DISPLAY_HEADER are defined and used; otherwise a
// NullDisplay is instantiated (headless repeater). A buzzer is wired only when
// the board defines PIN_BUZZER.
//
// It cannot be built by the host test suite (it needs the Adafruit nRF52 core,
// RadioLib and Bluefruit); the portable logic it drives is covered by the host
// tests under firmware/kernel/*.
#include <corefw/Kernel.h>

#if defined(COREFW_TARGET) && defined(NRF52_PLATFORM)

#include <Arduino.h>

#include <corefw/modules/CompanionModule.h>
#include <corefw/modules/RepeaterModule.h>
#include <corefw/protocol/Advert.h>
#include <corefw/runtime/Clock.h>
#include <corefw/runtime/Dispatcher.h>

#include <corefw/companion/Storage.h>
#include <corefw/companion/Transport.h>

#include "NRF52BLETransport.h"
#include "NRF52Diag.h"
#include "NRF52FileStore.h"
#include "NRF52Gps.h"
#include "NRF52USBSerialTransport.h"

// Display: a real panel when the board manifest declares one (DISPLAY_CLASS /
// DISPLAY_HEADER emitted by codegen), otherwise a no-op NullDisplay so headless
// boards (e.g. the SenseCAP Solar repeater) drive the same code with no panel.
#if defined(DISPLAY_CLASS)
#include DISPLAY_HEADER
namespace { using BoardDisplay = corefw::ui::DISPLAY_CLASS; constexpr bool kHasDisplay = true; }
#else
#include <corefw/ui/NullDisplay.h>
namespace { using BoardDisplay = corefw::ui::NullDisplay; constexpr bool kHasDisplay = false; }
#endif

// A piezo buzzer is wired only on boards that define PIN_BUZZER.
#if defined(PIN_BUZZER)
// Lives outside the kernel include root; the generated build adds -I firmware.
#include <drivers/buzzer/ArduinoBuzzer.h>
#endif

#ifndef BLE_PIN_CODE
#define BLE_PIN_CODE 0
#endif

using namespace corefw;

// --- Board services -------------------------------------------------------

// ArduinoClock is the kernel's monotonic time source on device.
class ArduinoClock : public Clock {
 public:
  uint32_t millis() const override { return ::millis(); }
};

// SoftRTC keeps wall-clock seconds; the app sets it via CMD_SET_DEVICE_TIME.
class SoftRTC {
 public:
  uint32_t now() const { return base_ + (::millis() - set_at_) / 1000; }
  void set(uint32_t secs) {
    base_ = secs;
    set_at_ = ::millis();
  }
  bool isSet() const { return base_ != 0; }
 private:
  uint32_t base_ = 0;
  uint32_t set_at_ = 0;
};

// Globals wired in setup().
static ArduinoClock g_clock;
static SoftRTC g_rtc;
static board::NRF52BLETransport g_ble;
static board::NRF52USBSerialTransport g_usb;
static BoardDisplay g_display;
#if defined(PIN_BUZZER)
static ui::ArduinoBuzzer g_buzzer(PIN_BUZZER);
#endif
static Dispatcher* g_dispatcher = nullptr;
static Kernel g_kernel;
static proto::LocalIdentity g_identity;
static board::NRF52FileStore g_fs;
static board::NRF52Gps g_gps;
static board::Watchdog g_wdt;
static board::SerialDebug g_dbg;

// Fault record lives in .noinit so its contents survive the reset that follows a
// hardfault; the boot banner reports the captured PC on the next start.
namespace corefw::board {
__attribute__((section(".noinit"))) FaultRecord g_fault_record;
}  // namespace corefw::board

// Cortex-M hardfault trampoline: pass the exception stack frame (MSP or PSP) to
// the capture routine, which records the faulting PC and reboots.
extern "C" void corefw_hardfault_capture(uint32_t* sp) {
  board::g_fault_record.magic = board::kFaultMagic;
  board::g_fault_record.pc = sp[6];   // stacked PC
  board::g_fault_record.lr = sp[5];   // stacked LR
  board::g_fault_record.cfsr = SCB->CFSR;
  NVIC_SystemReset();
}
extern "C" __attribute__((naked)) void HardFault_Handler(void) {
  __asm volatile(
      " tst lr, #4                          \n"
      " ite eq                              \n"
      " mrseq r0, msp                       \n"
      " mrsne r0, psp                       \n"
      " ldr r1, =corefw_hardfault_capture   \n"
      " bx r1                               \n");
}
static companion::PersistentStore g_store(g_fs);
static CompanionModule* g_companion = nullptr;  // resolved in setup()
static RepeaterModule* g_repeater = nullptr;    // resolved in setup() when selected
static companion::CompanionTransport* g_transport = nullptr;
static bool g_radio_ok = false;

static void applyProfileRadioDefaults(companion::CompanionState& state) {
#ifdef LORA_FREQ
  state.freq_khz = uint32_t(float(LORA_FREQ) * 1000.0f + 0.5f);
#endif
#ifdef LORA_BW
  state.bw_hz = uint32_t(float(LORA_BW) * 1000.0f + 0.5f);
#endif
#ifdef LORA_SF
  state.sf = LORA_SF;
#endif
#ifdef LORA_CR
  state.cr = LORA_CR;
#endif
#ifdef LORA_TX_POWER
  state.tx_power_dbm = LORA_TX_POWER;
#endif
}

static RadioConfig makeRadioConfig(const companion::CompanionState& state) {
  RadioConfig cfg;
  cfg.frequency_mhz = float(state.freq_khz) / 1000.0f;
  cfg.bandwidth_khz = float(state.bw_hz) / 1000.0f;
  cfg.spreading_factor = state.sf;
  cfg.coding_rate = state.cr;
  cfg.tx_power_dbm = state.tx_power_dbm;
  return cfg;
}

// CompanionHost implementation: device services (RTC, battery, persistence).
// Persistence flows through the byte-compatible PersistentStore, so writes land
// in the exact MeshCore file formats.
class WioCompanionHost : public companion::CompanionHost {
 public:
  uint32_t rtcNow() override { return g_rtc.now(); }
  void setRtc(uint32_t s) override { g_rtc.set(s); }
  uint16_t batteryMilliVolts() override {
    return g_kernel.board() ? g_kernel.board()->batteryMilliVolts() : 0;
  }
  uint32_t storageUsedKb() override { return g_fs.usedKb(); }
  uint32_t storageTotalKb() override { return g_fs.totalKb(); }
  const char* manufacturerName() override {
    return g_kernel.board() ? g_kernel.board()->manufacturerName() : "Seeed Studio";
  }
  void savePrefs() override { if (g_companion) g_store.savePrefs(g_companion->state()); }
  void saveContacts() override { if (g_companion) g_store.saveContacts(g_companion->state()); }
  void saveChannels() override { if (g_companion) g_store.saveChannels(g_companion->state()); }
  void applyRadioParams() override {
    if (!g_companion || !g_dispatcher) return;
    g_dispatcher->configureRadio(makeRadioConfig(g_companion->state()));
    g_dispatcher->setAllowFloodForward(g_companion->state().client_repeat != 0);
  }
  void applyTxPower() override { applyRadioParams(); }
  void radioStats(int16_t& noise_floor, int8_t& last_rssi, int8_t& last_snr_q4,
                  uint32_t& tx_air_s, uint32_t& rx_air_s) override {
    noise_floor = radioNoiseFloorDbm();
    RadioDriver* radio = g_kernel.board() ? g_kernel.board()->radio() : nullptr;
    last_rssi = radio ? int8_t(radio->lastRSSI()) : 0;
    last_snr_q4 = radio ? int8_t(radio->lastSNR() * 4.0f) : 0;
    tx_air_s = 0;
    rx_air_s = 0;
  }
  int16_t radioNoiseFloorDbm() const override {
    if (!g_radio_ok) return 0;
    RadioDriver* radio = g_kernel.board() ? g_kernel.board()->radio() : nullptr;
    return radio ? radio->noiseFloorDbm() : 0;
  }
  bool gpsEnabled() const override {
    return g_companion && g_companion->state().gps_enabled != 0 && g_gps.started();
  }
  bool gpsHasFix() const override { return g_gps.hasFix(); }
  uint8_t gpsSatellites() const override { return g_gps.satellites(); }
  int advertPath(const uint8_t* pub_key, uint32_t& recv_ts, uint8_t* path) override {
    if (!g_companion) return -1;
    return g_companion->advertPath(pub_key, recv_ts, path);
  }
  bool factoryReset() override {
    // Only an explicit CMD_FACTORY_RESET erases stored data.
    g_fs.remove(companion::PREFS_FILE);
    g_fs.remove(companion::CONTACTS_FILE);
    g_fs.remove(companion::CHANNELS_FILE);
    return true;
  }
};

static WioCompanionHost g_host;

// set the route bits on a packet built by the datagram builders (which leave
// route = 0), preserving the payload type.
static void setRoute(proto::Packet& pkt, uint8_t route) {
  pkt.header = uint8_t((pkt.header & ~proto::PH_ROUTE_MASK) | (route & proto::PH_ROUTE_MASK));
}

