meshcore-cz/corefw/firmware/platform/nrf52/nrf52_target_main.cpp
// WioMeshSender bridges the companion command handler to the radio scheduler.
// Flood packets get ROUTE_FLOOD; packets with a known return path go ROUTE_DIRECT
// with the path attached. The Dispatcher owns airtime/duty-cycle scheduling.
class WioMeshSender : public companion::MeshSender {
 public:
  int sendToContact(proto::Packet& pkt, const companion::ContactInfo& c,
                    uint32_t& est_timeout) override {
    if (!g_dispatcher) return companion::SEND_FAILED;
    if (c.out_path_len == companion::OUT_PATH_UNKNOWN) {
      setRoute(pkt, proto::ROUTE_FLOOD);
      pkt.setPathHashSizeAndCount(1, 0);
      est_timeout = 8000;
      g_dispatcher->send(pkt);
      return companion::SEND_FLOOD;
    }
    setRoute(pkt, proto::ROUTE_DIRECT);
    applyPath(pkt, c.out_path, c.out_path_len);
    est_timeout = 3000;
    g_dispatcher->send(pkt);
    return companion::SEND_DIRECT;
  }
  bool sendGroup(proto::Packet& pkt) override {
    if (!g_dispatcher) return false;
    setRoute(pkt, proto::ROUTE_FLOOD);
    pkt.setPathHashSizeAndCount(1, 0);
    g_dispatcher->send(pkt);
    return true;
  }
  bool sendDirect(proto::Packet& pkt, const uint8_t* path, uint8_t path_len) override {
    if (!g_dispatcher) return false;
    setRoute(pkt, proto::ROUTE_DIRECT);
    applyPath(pkt, path, path_len);
    g_dispatcher->send(pkt);
    return true;
  }
  bool sendZeroHop(proto::Packet& pkt) override {
    if (!g_dispatcher) return false;
    setRoute(pkt, proto::ROUTE_DIRECT);
    pkt.path_len = 0;
    g_dispatcher->send(pkt);
    return true;
  }
  bool sendRawPacket(const uint8_t* wire, size_t len, uint8_t /*priority*/) override {
    if (!g_dispatcher) return false;
    proto::Packet pkt;
    if (!pkt.readFrom(wire, len)) return false;
    g_dispatcher->send(pkt);
    return true;
  }
  bool sendSelfAdvert(bool flood) override {
    return sendAdvert(proto::ADV_TYPE_CHAT,
                      g_companion ? g_companion->state().node_name : "corefw", flood);
  }
  // Repeater self-advert (ADV_TYPE_REPEATER) so peers learn this is a relay.
  bool sendRepeaterAdvert(bool flood) {
    return sendAdvert(proto::ADV_TYPE_REPEATER,
                      g_repeater ? g_repeater->advertName() : "repeater", flood);
  }
  bool sendAck(const uint8_t* ack, uint8_t ack_len, const companion::ContactInfo& to) override {
    if (!g_dispatcher) return false;
    proto::Packet pkt;
    pkt.header = uint8_t(proto::PAYLOAD_ACK << proto::PH_TYPE_SHIFT);
    std::memcpy(pkt.payload, ack, ack_len);
    pkt.payload_len = ack_len;
    if (to.out_path_len == companion::OUT_PATH_UNKNOWN) {
      setRoute(pkt, proto::ROUTE_FLOOD);
      pkt.setPathHashSizeAndCount(1, 0);
    } else {
      setRoute(pkt, proto::ROUTE_DIRECT);
      applyPath(pkt, to.out_path, to.out_path_len);
    }
    g_dispatcher->send(pkt);
    return true;
  }
  uint32_t rtcNowUnique() override { return g_rtc.now() + (seq_++ & 0x3); }
  uint32_t random32() override { rng_ = rng_ * 1664525u + 1013904223u; return rng_; }

 private:
  // Build and flood an advert of the given type/name. Location is attached only
  // when a companion is present, opted in, and we have a fix — so a pure
  // (companion-less) repeater still advertises its presence.
  bool sendAdvert(uint8_t type, const char* name, bool flood) {
    if (!g_dispatcher) return false;
    proto::AdvertData ad;
    ad.type = type;
    std::strncpy(ad.name, name ? name : "", sizeof(ad.name) - 1);
    ad.name[sizeof(ad.name) - 1] = 0;
    if (g_companion) {
      const companion::CompanionState& st = g_companion->state();
      if (st.advert_loc_policy == companion::ADVERT_LOC_SHARE &&
          (st.lat_e6 != 0 || st.lon_e6 != 0)) {
        ad.has_loc = true;
        ad.lat = st.lat_e6;
        ad.lon = st.lon_e6;
      }
    }
    proto::Packet pkt;
    if (!proto::buildAdvert(pkt, g_identity, g_rtc.now(), ad)) return false;
    setRoute(pkt, proto::ROUTE_FLOOD);
    if (!flood) pkt.setPathHashSizeAndCount(1, 0);  // zero-hop
    g_dispatcher->send(pkt);
    return true;
  }
  static void applyPath(proto::Packet& pkt, const uint8_t* path, uint8_t path_len) {
    uint8_t n = path_len & 63;
    pkt.setPathHashSizeAndCount(1, n);
    memcpy(pkt.path, path, n);
  }
  uint32_t seq_ = 0;
  uint32_t rng_ = 0xC0FFEE11;
};

static WioMeshSender g_sender;

// Minimal Wio joystick handling for the MeshCore-style companion pages. The
// button pins are active-low in the board variant.
struct ButtonEdge {
  uint8_t pin;
  bool last = true;
  uint32_t changed_at = 0;
  bool began = false;

  void begin() {
    pinMode(pin, INPUT_PULLUP);
    last = digitalRead(pin);
    changed_at = millis();
    began = true;
  }

  bool pressed() {
    if (!began) begin();
    bool now = digitalRead(pin);
    uint32_t t = millis();
    if (now != last && t - changed_at > 40) {
      last = now;
      changed_at = t;
      return now == LOW;
    }
    return false;
  }
};

#if defined(PIN_BUTTON4) && defined(PIN_BUTTON5) && defined(PIN_BUTTON6)
static ButtonEdge g_btn_left{PIN_BUTTON4};
static ButtonEdge g_btn_right{PIN_BUTTON5};
static ButtonEdge g_btn_enter{PIN_BUTTON6};
#endif

// findCompanion locates the CompanionModule the generated composition
// registered, so we can attach the board's transport/display/buzzer to it.
static CompanionModule* findCompanion() {
  for (int i = 0; i < g_kernel.moduleCount(); ++i) {
    Module* m = g_kernel.module(i);
    if (strcmp(m->name(), "companion") == 0) return static_cast<CompanionModule*>(m);
  }
  return nullptr;
}

// findRepeater locates the RepeaterModule when the profile selected the repeater
// role, so the loop can drive its periodic self-advert.
static RepeaterModule* findRepeater() {
  for (int i = 0; i < g_kernel.moduleCount(); ++i) {
    Module* m = g_kernel.module(i);
    if (strcmp(m->name(), "repeater") == 0) return static_cast<RepeaterModule*>(m);
  }
  return nullptr;
}

static void showStage(const char* line1, const char* line2 = "") {
  // Serial breadcrumb: the last stage printed before silence is where a freeze
  // happened (no-op on USB companion builds, where the CDC carries protocol).
  g_dbg.log("stage: %s %s", line1, line2);
  if (!g_display.isOn()) return;
  g_display.startFrame();
  g_display.setTextSize(1);
  g_display.setColor(ui::Display::LIGHT);
  g_display.setCursor(0, 0);
  g_display.print(line1);
  g_display.setCursor(0, 14);
  g_display.print(line2);
  g_display.endFrame();
}

// Render the previous boot's crash info to the OLED. This is the only diagnostic
// visible on a USB-companion build (where the serial console is the protocol
// channel), so it holds long enough to read or photograph.
static void showFreezeDiag() {
  if (!g_display.isOn()) return;
  char l[40];
  g_display.startFrame();
  g_display.setTextSize(1);
  g_display.setColor(ui::Display::LIGHT);
  g_display.setCursor(0, 0);
  g_display.print("FREEZE DIAG");
  g_display.setCursor(0, 12);
  g_display.print(board::ResetReason::text());
  g_display.setCursor(0, 24);
  std::snprintf(l, sizeof(l), "at: %s", board::crumbName(board::bootCrumb()));
  g_display.print(l);
  if (board::g_fault_record.magic == board::kFaultMagic) {
    g_display.setCursor(0, 36);
    std::snprintf(l, sizeof(l), "pc %08lx", (unsigned long)board::g_fault_record.pc);
    g_display.print(l);
    g_display.setCursor(0, 48);
    std::snprintf(l, sizeof(l), "cfsr %08lx", (unsigned long)board::g_fault_record.cfsr);
    g_display.print(l);
  }
  g_display.endFrame();
}

void setup() {
  // Snapshot why we rebooted before anything else touches the register — a
  // "WATCHDOG" reason here is the signature of the freeze we are chasing.
  board::captureBoot();  // snapshot reset reason + last crumb before overwriting
  board::crumb(board::CRUMB_SETUP);

  // 1. Bring up the board (buses, radio, power rails) via the composition root.
  corefw_compose(g_kernel);
  if (g_kernel.board()) g_kernel.board()->begin();
  g_companion = findCompanion();
  g_repeater = findRepeater();

  // Serial debug console: usable whenever the USB CDC is not the companion
  // protocol transport (i.e. BLE builds), so it never corrupts framing.
  bool usb_companion =
      g_companion && g_companion->transportKind() == CompanionTransportKind::USB;
  g_dbg.begin(/*enabled=*/!usb_companion);

  // Bring up the display early so every potentially blocking startup stage has
  // a visible breadcrumb on the OLED.
  bool display_ok = g_display.begin();
  if (display_ok) {
    if (board::crashedLastBoot()) {
      showFreezeDiag();  // reset reason + crumb + fault PC — hold to read it
      delay(6000);
    }
    showStage("corefw display",
              g_kernel.board() ? g_kernel.board()->boardName() : "corefw");
    delay(500);
  }
  board::g_fault_record.magic = 0;  // consumed by serial + OLED; clear for next boot

