meshcore-cz/corefw/firmware/platform/nrf52/nrf52_target_main.cpp
  // 2. Mount the existing filesystem (never formats) and load identity, prefs,
  //    contacts and channels in MeshCore's on-flash formats. A device reflashed
  //    from MeshCore keeps its identity (mesh address) and data. Only a fresh
  //    device generates a new identity here (seeded from the hardware RNG).
  // Storage mount. The QSPI guard lives inside NRF52FileStore (an InternalFS
  // marker file that survives any reset), so a crashing QSPI mount latches off
  // and can never boot-loop. The crumb records that we were here for the diag.
  showStage("startup", "storage");
  board::crumb(board::CRUMB_STORAGE_QSPI);
  g_fs.begin();
  board::crumb(board::CRUMB_SETUP);
  if (g_companion) {
    applyProfileRadioDefaults(g_companion->state());
    uint8_t seed[proto::SEED_SIZE];
    for (size_t i = 0; i < sizeof(seed); i++) seed[i] = uint8_t(random(256));
    g_store.loadAll(g_companion->state(), seed);
    g_identity = g_companion->state().self;
  }

  // 3. Build the radio scheduler around the board's configured radio.
  showStage("startup", "radio");
  RadioDriver* radio = g_kernel.board() ? g_kernel.board()->radio() : nullptr;
  RadioConfig cfg = g_companion ? makeRadioConfig(g_companion->state()) : RadioConfig{};
  static Dispatcher dispatcher(radio, &g_clock, g_identity.pub_key, cfg);
  g_dispatcher = &dispatcher;
  if (g_companion) {
    dispatcher.setAllowFloodForward(g_companion->state().client_repeat != 0);
  }
  if (radio) {
    g_radio_ok = radio->begin(cfg);
    if (!g_radio_ok) showStage("radio init", "failed");
  }
  // Deliver received packets to the companion, which decrypts those addressed
  // to this node and surfaces messages/adverts to the app.
  if (g_companion) {
    dispatcher.subscribe(g_companion);
    // Raw-RX diagnostics: stream every received frame to the app's packet log
    // (LOG_RX_DATA) through the companion's non-blocking transport queue.
    dispatcher.setRawRxObserver(g_companion);
    // Surface completed TRACE round-trips to the app (Trace Path view).
    dispatcher.setTraceObserver(g_companion);
  }

  // 4. Peripherals for the companion experience.
#if defined(PIN_BUZZER)
  showStage("startup", "buzzer");
  g_buzzer.begin();
#endif
  if (g_companion && g_companion->transportKind() == CompanionTransportKind::USB) {
    showStage("startup", "usb serial");
    g_usb.begin(115200);
    g_transport = &g_usb;
  } else {
    showStage("startup", "ble");
    char ble_name[32];
    companion::formatBleDeviceName(
        ble_name, sizeof(ble_name),
        g_companion ? g_companion->state().node_name : "corefw");
    g_ble.begin(ble_name, BLE_PIN_CODE);
    g_transport = &g_ble;
  }

  // 5. Attach everything to the companion module and start the kernel.
  if (g_companion) {
    CompanionModule* comp = g_companion;
    comp->attachClock(&g_clock);
    comp->attachHost(&g_host);
    comp->attachSender(&g_sender);
    comp->attachTransport(g_transport);
    comp->attachDisplay(kHasDisplay ? &g_display : nullptr);
#if defined(PIN_BUZZER)
    comp->attachBuzzer(&g_buzzer);
#endif
  }

#if defined(PIN_BUTTON4) && defined(PIN_BUTTON5) && defined(PIN_BUTTON6)
  g_btn_left.begin();
  g_btn_right.begin();
  g_btn_enter.begin();
#endif

  // 6. GPS: boards that report the gps capability (Wio Tracker L1, SenseCAP
  // Solar) carry an on-board NMEA receiver on Serial1. Track our own position so
  // it shows on-screen, feeds SELF_INFO, and can be shared in adverts. Enabled
  // by default since the hardware is present; the app can toggle it per session.
  if (g_companion && g_kernel.board() && g_kernel.board()->capabilities().gps) {
    showStage("startup", "gps");
    g_companion->state().gps_enabled = 1;
    g_gps.begin();
  }

  static struct : PowerCoordinator {
    void requireRadioUntil(uint64_t) override {}
    void scheduleWake(uint64_t) override {}
    void preventDeepSleep(const char*) override {}
    void releaseDeepSleep(const char*) override {}
  } power;
  showStage("startup", "kernel");
  g_kernel.begin(dispatcher, power);
  if (g_companion) g_companion->playStartupMelody();
  showStage("startup", "loop");

  // Arm the watchdog last, so a hang anywhere in the steady-state loop (not the
  // one-time bring-up) trips it. 8s is comfortably longer than any legitimate
  // loop iteration, including BLE pairing.
  g_wdt.begin(8000);
}

// Fold GPS updates into device state: refresh our position, seed the RTC from
// satellite time when we have no other clock, and re-advertise on the configured
// interval so peers (and the map) see a fresh location.
static void serviceGps(uint32_t now_ms) {
  if (!g_companion || !g_gps.started()) return;
  g_gps.loop();
  if (!g_gps.hasFix()) return;

  companion::CompanionState& st = g_companion->state();
  st.lat_e6 = g_gps.latE6();
  st.lon_e6 = g_gps.lonE6();

  // The Wio has no battery-backed RTC; adopt GPS UTC once if unset.
  uint32_t gps_time = g_gps.unixTime();
  if (gps_time != 0 && !g_rtc.isSet()) g_rtc.set(gps_time);

  // Periodic self-advert (gps_interval seconds, 0 = disabled).
  static uint32_t last_advert_ms = 0;
  uint32_t interval_ms = st.gps_interval * 1000u;
  if (interval_ms != 0 && (last_advert_ms == 0 || now_ms - last_advert_ms >= interval_ms)) {
    g_sender.sendSelfAdvert(/*flood=*/true);
    last_advert_ms = now_ms;
  }
}

void loop() {
  const uint32_t now = g_clock.millis();
  g_wdt.feed();
  g_dbg.heartbeat(now);
  board::crumb(board::CRUMB_LOOP_RX);
  if (g_dispatcher) g_dispatcher->loop();
  board::crumb(board::CRUMB_LOOP_GPS);
  serviceGps(now);
  board::crumb(board::CRUMB_LOOP_TICK);

  // Reflect transport connection state as kernel events, then pump the companion.
  static bool wasConnected = false;
  if (g_companion) {
#if defined(PIN_BUTTON4) && defined(PIN_BUTTON5) && defined(PIN_BUTTON6)
    if (g_btn_left.pressed()) g_companion->onButton(-1);
    if (g_btn_right.pressed()) g_companion->onButton(+1);
    if (g_btn_enter.pressed()) g_companion->onButtonEnter();
#endif
    bool nowConnected = g_transport ? g_transport->connected() : false;
    if (nowConnected != wasConnected) {
      Event e;
      e.type = nowConnected ? EventType::CompanionConnected : EventType::CompanionDisconnected;
      g_kernel.dispatch(e);
      wasConnected = nowConnected;
    }
    g_companion->tick(now);
  }

  // Repeater self-advert: one zero-hop advert shortly after boot (so neighbours
  // learn the relay) then periodically per the module's configured interval.
  if (g_repeater && g_radio_ok) {
    static bool boot_advert_sent = false;
    static uint32_t last_advert_ms = 0;
    const uint32_t interval_ms = g_repeater->advertIntervalSeconds() * 1000u;
    if (!boot_advert_sent && now >= 16000) {
      g_sender.sendRepeaterAdvert(/*flood=*/false);
      last_advert_ms = now;
      boot_advert_sent = true;
    } else if (boot_advert_sent && interval_ms != 0 && now - last_advert_ms >= interval_ms) {
      g_sender.sendRepeaterAdvert(/*flood=*/false);
      last_advert_ms = now;
    }
  }
  // Power: when there's nothing left to make progress on this pass, hand the
  // core to the SoftDevice until the next interrupt (radio DIO, BLE, GPS UART,
  // FreeRTOS tick). This is a light idle — the BLE link and radio receiver stay
  // live and scheduled retransmits still fire within a tick — but it collapses
  // the busy-loop's idle current. Safe on every nRF52 build, connected or not.
  const bool pending = (g_dispatcher && g_dispatcher->queueDepth() > 0) ||
                       (g_companion && g_companion->hasPendingWork());
  if (!pending && g_kernel.board()) g_kernel.board()->lightSleep(0);

  board::crumb(board::CRUMB_LOOP_IDLE);
}

#endif  // COREFW_TARGET && NRF52_PLATFORM
